refactor: application and library grouping
